wegam/STM32F1xWorkSpace/Examples/HC/PL012V11.C
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void GT32L32_Configuration(void)
{
	GT32L32_Info.GT32L32_Port.sSPIx=SPI1;
	GT32L32_Info.GT32L32_Port.sGT32L32_CS_PORT=GPIOA;
	GT32L32_Info.GT32L32_Port.sGT32L32_CS_PIN=GPIO_Pin_4;
	GT32L32_Info.GT32L32_Port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_128;
	
	GT32L32_ConfigurationNR(&GT32L32_Info);				//普通SPI通讯方式配置
	
	GPIO_Configuration_OPP50	(GPIOA,GPIO_Pin_4);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
}


/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_Configuration(void)
{
	unsigned long	LCDTime	=	0xFFFFFF;
	u32 w	=	0,n	=	0;
	R61509V.R61509V_sCS_PORT		=	GPIOB;
	R61509V.R61509V_sCS_Pin			=	GPIO_Pin_7;
	
	R61509V.R61509V_sRS_PORT		=	GPIOB;
	R61509V.R61509V_sRS_Pin			=	GPIO_Pin_6;
	
	R61509V.R61509V_sWR_PORT		=	GPIOB;
	R61509V.R61509V_sWR_Pin			=	GPIO_Pin_8;
	
	R61509V.R61509V_sRD_PORT		=	GPIOB;
	R61509V.R61509V_sRD_Pin			=	GPIO_Pin_5;
	
	R61509V.R61509V_sREST_PORT	=	GPIOB;
	R61509V.R61509V_sREST_Pin		=	GPIO_Pin_9;
	
	R61509V.R61509V_sBL_PORT		=	GPIOB;
	R61509V.R61509V_sBL_Pin			=	GPIO_Pin_0;
	
	R61509V.R61509V_sTE_PORT		=	GPIOB;
	R61509V.R61509V_sTE_Pin			=	GPIO_Pin_4;
	
	R61509V.R61509V_sDATABUS_PORT	=	GPIOC;
	R61509V.R61509V_sDATABUS_Pin	=	GPIO_Pin_All;
	
	R61509V_PinConf(&R61509V);
	
	R61509V_Delay(LCDTime);
//	w	=	12345678;
//	PL010V13_PrintfString(0		,0	,16	,"%8d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数

//	R61509V_Clean(0X01CF);			//清除屏幕函数--黄色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0X07FF);			//清除屏幕函数--红色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0x07E0);			//清除屏幕函数--紫色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0XFC07);			//清除屏幕函数--蓝色
//	R61509V_Delay(LCDTime);
//	
//	R61509V_Clean(0xF800);			//清除屏幕函数--蓝白
//	R61509V_Delay(LCDTime);

//	R61509V_Clean(R61509V_BLACK);			//清除屏幕函数------
//	R61509V_Delay(LCDTime);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void CS5530_Configuration(void)
{
	CS5530.CS5530_CS_PORT=GPIOC;
	CS5530.CS5530_CS_Pin=GPIO_Pin_3;
	
	CS5530.CS5530_SDI_PORT=GPIOC;
	CS5530.CS5530_SDI_Pin=GPIO_Pin_2;
	
	CS5530.CS5530_SDO_PORT=GPIOC;
	CS5530.CS5530_SDO_Pin=GPIO_Pin_1;
	
	CS5530.CS5530_SCLK_PORT=GPIOC;
	CS5530.CS5530_SCLK_Pin=GPIO_Pin_0;
	
	CS5530_Initialize(&CS5530);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void RS485_Configuration(void)
{
	RS485.USARTx=USART2;
	RS485.RS485_CTL_PORT=GPIOA;
	RS485.RS485_CTL_Pin=GPIO_Pin_1;
	
	RS485_DMA_ConfigurationNR	(&RS485,19200,(u32*)RxdBuffe,256);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void LCD_PowerUp(void)
{	
//	u16 i=0,j=0;
	
	
	
	
	
//	R61509V_DrawDot(50,50,0X5458);
//	R61509V_DrawDot_big(50,50,0X5458);
//	R61509V_DrawLine(0,0,240,400,0X5458);
//	R61509V_DrawLine(0,400,240,0,0X5458);
	
//	R61509V_DrawCircle(120,100, 50,0,0X5458);				//画一个圆形框
	
//	R61509V_DrawCircle(120,200, 120,0,0X01CF);				//画一个圆形框
	
//	R61509V_DrawCircle(120,400, 80,0,0X5458);				//画一个圆形框
//	
//	R61509V_DrawCircle(120,0, 80,0,0X5458);					//画一个圆形框
//	
//	R61509V_DrawCircle(120,200, 80,1,0X5458);				//画一个圆形框
//	
//	R61509V_DrawCircle(200,120, 50,0,0xF800);				//画一个圆形框
//	
//	R61509V_DrawCircle(120,200, 30,1,0X07FF);				//画一个圆形框
	
//	R61509V_DrawRectangle(3,3,237,397,0x07E0);			//画一个矩形框
//	R61509V_DrawRectangle(4,4,236,396,0x07E0);			//画一个矩形框
//	R61509V_DrawRectangle(5,5,235,395,0x07E0);			//画一个矩形框
//	R61509V_DrawRectangle(6,6,234,394,0x07E0);			//画一个矩形框
//	
//	R61509V_DrawRectangle(7,7,233,393,0X07FF);			//画一个矩形框
//	R61509V_DrawRectangle(8,8,232,392,0X07FF);			//画一个矩形框
//	R61509V_DrawRectangle(9,9,231,391,0X07FF);			//画一个矩形框
//	R61509V_DrawRectangle(10,10,230,390,0X07FF);		//画一个矩形框
//	R61509V_DrawRectangle(11,11,229,389,0X07FF);		//画一个矩形框
//	R61509V_DrawRectangle(12,12,228,388,0X07FF);			//画一个矩形框
//	R61509V_DrawLine(12,12,228,388,0X5458);						//AB 两个坐标画一条直线
//	R61509V_DrawLine(12,388,228,12,0X5458);						//AB 两个坐标画一条直线
	
//	R61509V_DrawLine(0,10,400,10,0X5458);						//AB 两个坐标画一条直线
//	
//	R61509V_DrawLine(0,20,400,20,0X5458);						//AB 两个坐标画一条直线
	
//	R61509V_DrawLine(0,100,160,100,0X5458);						//AB 两个坐标画一条直线
//	
//	R61509V_DrawLine(80,0,80,400,0X5458);						//AB 两个坐标画一条直线
	
//	R61509V_DrawRectangle(10,10,390,230,0X07FF);		//画一个矩形框
	
//	R61509V_DrawCircle(200,120, 10,1,0X5458);					//画一个圆形框
//	
//	R61509V_DrawCircle(200,120, 80,0,0X5458);					//画一个圆形框
	
//	R61509V_DrawLine(240,240,20,240,0X5458);						//AB 两个坐标画一条直线
	
